Revit 2026 API

# SpatialElementGeometryResults Properties

---

The SpatialElementGeometryResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace